Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
-200]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-gnomad: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-gnomad: Read complete after 0s [id=1028699845]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-gnomad: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-gnomad: Read complete after 0s [id=4096682290]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gh5prfe872-dn686w9ri2-OPTIONS-200]
module.pgxflow[0].module.lambda-initFlow.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-initFlow:pgxflow-backend-initFlow-0]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat-gnomad:pgxflow-backend-pharmcat-gnomad-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-gnomad:pgxflow-backend-gnomad-0]
module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-initFlow]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.pgxflow[0].aws_api_gateway_integration_response.qcnotes-post: Refreshing state... [id=agir-6cpu5d2jyi-cw1m64-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat-gnomad]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-gnomad]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=2800688573]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:557690600725:splitQuery:38b9ba2a-3c5c-487c-8ab7-f25697adfce5]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=2800688573]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=2722236234]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.pgxflow[0].aws_sns_topic_subscription.initFlow: Refreshing state... [id=arn:aws:sns:ap-southeast-3:557690600725:pgxflow-backend-initFlow:5dada65d-0e46-4f38-95e3-71db209bd203]
module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_api: Refreshing state... [id=AllowAPIInitFlowInvoke]
module.pgxflow[0].aws_lambda_permission.initflow_invoke_permission_sns: Refreshing state... [id=AllowSNSInitFlowInvoke]
module.pgxflow[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-6cpu5d2jyi-n8pelm-POST]
module.pgxflow[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-6cpu5d2jyi-n8pelm-PATCH]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-gh5prfe872-evdzq7-ANY]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-postprocessor: Read complete after 0s [id=4106732788]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.pgxflow[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-6cpu5d2jyi-n8pelm-PATCH-200]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-gh5prfe872-evdzq7-ANY-200]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.pgxflow[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-6cpu5d2jyi-n8pelm-POST-200]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup: Reading...
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-gh5prfe872-ebz19c-ANY]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-lookup: Read complete after 0s [id=3828271487]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0]
module.pgxflow[0].aws_api_gateway_deployment.PgxApi: Refreshing state... [id=ze4d05]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-gh5prfe872-ebz19c-ANY-200]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-04i7mj-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-gh5prfe872-04i7mj-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-ng48da-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-gh5prfe872-u99qoe-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-ix72om-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-gh5prfe872-ix72om-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-gh5prfe872-toqg0u-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-gh5prfe872-toqg0u-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-gh5prfe872-ng48da-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-gh5prfe872-u99qoe-GET]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-gh5prfe872-o6foff-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-gh5prfe872-1lh8dq-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-gh5prfe872-xp2pn9-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-gh5prfe872-myeabw-POST]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-gh5prfe872-xp2pn9-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-o6foff-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-gh5prfe872-dp09v9-GET]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-1lh8dq-POST]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-gh5prfe872-dp09v9-POST]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-lookup:pgxflow-backend-lookup-0]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-gh5prfe872-mi8486-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-gh5prfe872-xil2zq-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-gh5prfe872-7d6nnu-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-gh5prfe872-x1329u-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-tzz7ht-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-gh5prfe872-tzz7ht-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-gh5prfe872-x1329u-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-gh5prfe872-8vuzyh-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-gh5prfe872-xil2zq-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-mi8486-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-gh5prfe872-7d6nnu-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-gh5prfe872-8vuzyh-GET]
module.pgxflow[0].aws_api_gateway_stage.PgxApi: Refreshing state... [id=ags-6cpu5d2jyi-prod]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-gh5prfe872-04i7mj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-04i7mj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-ng48da-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-ix72om-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-gh5prfe872-ix72om-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-gh5prfe872-toqg0u-GET-200]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-gh5prfe872-pfkd7s-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-9to1fb-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-gh5prfe872-pszltn-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-gh5prfe872-id4j64-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-gh5prfe872-pszltn-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-gh5prfe872-pfkd7s-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-id4j64-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-gh5prfe872-9to1fb-GET]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-gh5prfe872-ng48da-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-gh5prfe872-u99qoe-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-postprocessor]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-gh5prfe872-o6foff-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-gh5prfe872-1lh8dq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-gh5prfe872-xp2pn9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-gh5prfe872-myeabw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-o6foff-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-gh5prfe872-xp2pn9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-1lh8dq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-gh5prfe872-dp09v9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-gh5prfe872-dp09v9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-gh5prfe872-xil2zq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-gh5prfe872-mi8486-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-gh5prfe872-7d6nnu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-gh5prfe872-x1329u-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-tzz7ht-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-gh5prfe872-tzz7ht-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-gh5prfe872-x1329u-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-gh5prfe872-8vuzyh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-gh5prfe872-xil2zq-GET-200]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-lookup]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-gh5prfe872-toqg0u-POST-200]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-z6d7qk-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-gh5prfe872-77nvhp-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-77nvhp-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-gh5prfe872-79sgpa-GET]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-gh5prfe872-phz80h-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-gh5prfe872-bz4sgj-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-gh5prfe872-79sgpa-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-gh5prfe872-phz80h-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-gh5prfe872-6wobu7-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-gh5prfe872-bz4sgj-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-gh5prfe872-h7987u-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-gh5prfe872-z6d7qk-GET]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-gh5prfe872-h7987u-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-gh5prfe872-8vuzyh-GET-200]
module.pgxflow[0].aws_api_gateway_method_settings.PgxApi: Refreshing state... [id=6cpu5d2jyi-prod-*/*]
module.pgxflow[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1JRN2AGPB9GTF]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-gh5prfe872-44w0o8-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-gh5prfe872-tuc20b-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-gh5prfe872-bmrcjq-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-gh5prfe872-bmrcjq-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-gh5prfe872-i8xyzu-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-gh5prfe872-44w0o8-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-gh5prfe872-tuc20b-POST]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-gh5prfe872-i8xyzu-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-9to1fb-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-gh5prfe872-u99qoe-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-gh5prfe872-pfkd7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-gh5prfe872-pfkd7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-gh5prfe872-7d6nnu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-gh5prfe872-9to1fb-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses: Refreshing state... [id=agmr-gh5prfe872-myeabw-GET-200]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-gh5prfe872-myeabw-GET]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-gh5prfe872-id4j64-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-gh5prfe872-pszltn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-mi8486-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-gh5prfe872-77nvhp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-77nvhp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-gh5prfe872-79sgpa-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-gh5prfe872-phz80h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-gh5prfe872-bz4sgj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-79sgpa-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-gh5prfe872-phz80h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-gh5prfe872-6wobu7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-gh5prfe872-bz4sgj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-z6d7qk-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-gh5prfe872-z6d7qk-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-gh5prfe872-h7987u-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-gh5prfe872-44w0o8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-gh5prfe872-tuc20b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-gh5prfe872-bmrcjq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-gh5prfe872-bmrcjq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-gh5prfe872-i8xyzu-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-gh5prfe872-44w0o8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-gh5prfe872-tuc20b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-gh5prfe872-h7987u-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-gh5prfe872-i8xyzu-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-gh5prfe872-pszltn-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Read complete after 0s [id=2795459981]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-gh5prfe872-myeabw-GET-200]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Read complete after 0s [id=521345094]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-gh5prfe872-id4j64-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPostprocessorInvoke]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Read complete after 0s [id=4049522985]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission: Refreshing state... [id=SNSDbsnpAllowInvoke]
module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp: Refreshing state... [id=arn:aws:sns:ap-southeast-3:557690600725:pgxflow-backend-dbsnp:42e33aad-1d23-4aa8-ac95-76bd191fe021]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-preprocessor]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.preprocessor_invoke_permission: Refreshing state... [id=SNSPreprocessorAllowInvoke]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat: Refreshing state... [id=PGxFlowBackendAllowLambdaPharmcatInvoke]
module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic_subscription.preprocessor: Refreshing state... [id=arn:aws:sns:ap-southeast-3:557690600725:pgxflow-backend-preprocessor:99ab75e1-d98a-44b1-a072-c5d65f97e7c1]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-gh5prfe872-6wobu7-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post: Refreshing state... [id=agmr-gh5prfe872-6wobu7-POST-200]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-gh5prfe872-6wobu7-POST]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-gh5prfe872-6wobu7-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=jlnms4]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-gh5prfe872-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=gh5prfe872-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E3BVPZ3UNLY7V7]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=bbc3e3f6-a6cd-4f16-b162-50b15134fdf7]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E3621CY4Z86ZCY]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=1134445474]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=f8251abd-d71d-b847-e132-122d8c460f41]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250331043638413200000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m18s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7380076592942501476]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=6545472974661272103]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "96f1b3b625ac3771bfd8bbe96baad67eeff9c6d0"
      ~ output_base64sha256 = "tGCSO7IkxV5HP3o1y4BT8ArA3NW0yNVmhvLU1Zi3YUE=" -> "31ipqbIDIF93Dr/HZZ3Wdw3umbA9EUigQHe9cRlXzMg="
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:15" -> (known after apply)
      ~ code_sha256                 = "tGCSO7IkxV5HP3o1y4BT8ArA3NW0yNVmhvLU1Zi3YUE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-31T07:00:35.375+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "tGCSO7IkxV5HP3o1y4BT8ArA3NW0yNVmhvLU1Zi3YUE=" -> "31ipqbIDIF93Dr/HZZ3Wdw3umbA9EUigQHe9cRlXzMg=" # forces replacement
      ~ source_code_size            = 15166659 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ code_sha256                 = "2niJ7U64y5I0Rkr+tzVaPv9u2pGQ1r0cCemurP+SmZo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-31T07:00:41.005+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "4Peb+oJR9V+92uYKjqjofvxp9NWxP0R9A2I2h8fwlSYdImPhaxgtmCycsdO0pGzZAmn+xogpi9z2Up12Ir8Qgg==" -> "qbOJ4nWtSY57Jws1C7oTOwprVbEWhSiC4t3NJobpR1heEoeOmTmb2kFHmV3fqqdQ/ya29EKpnnl/Ipz3BxWgNw==" # forces replacement
      ~ source_code_size            = 18422770 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20250331043651003800000004"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v0.17.1-alpha-111-g396a3d4+" -> "v0.17.1-alpha-66-g15ffdaf+"
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "6545472974661272103" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "a8b290c94ffb9f2318724816c433702f29564d4b" -> "bb8ca15c0202a9457143eb14a20842dc9e839371"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "7380076592942501476" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "a8b290c94ffb9f2318724816c433702f29564d4b" -> "bb8ca15c0202a9457143eb14a20842dc9e839371"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "f8251abd-d71d-b847-e132-122d8c460f41" -> (known after apply)
      ~ triggers_replace = [
          ~ "v0.17.1-alpha-111-g396a3d4+" -> "v0.17.1-alpha-66-g15ffdaf+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5095974604302084765" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945049971604200" -> "1754293746276699000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5558522433617224784" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945049073436000" -> "1754293745125372800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8401034330353234885" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945050562530000" -> "1754293745544007000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6913227370091682496" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945049554837000" -> "1754293745546218000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7111861135820580594" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945049980485000" -> "1754293745526112000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:294d1c3d62d625f309ffee238056a425abb79eb6dae8b4ac4a02023fbe881b1c557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:294d1c3d62d625f309ffee238056a425abb79eb6dae8b4ac4a02023fbe881b1c" -> (known after apply)
        name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ repo_digest  = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:f71b01fe3807dd641873b4fe6a9b1d698a3061504132eeff844e9cc827142d36" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "e19145c68f230bf805e77564eaa3e7dda8d563c1" -> "97f79d1c11d7dcfb964d8f23ea3b134c35956b39"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:f71b01fe3807dd641873b4fe6a9b1d698a3061504132eeff844e9cc827142d36" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:f71b01fe3807dd641873b4fe6a9b1d698a3061504132eeff844e9cc827142d36" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "e19145c68f230bf805e77564eaa3e7dda8d563c1" -> "97f79d1c11d7dcfb964d8f23ea3b134c35956b39"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4007904069502831607" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065471144000" -> "1754293750573519000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5014000469172618251" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065326643000" -> "1754293750298585800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7343786449859107088" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065413099000" -> "1754293750554680200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initFlow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:15",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2320091482290618791" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065497170000" -> "1754293750333915000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:f71b01fe3807dd641873b4fe6a9b1d698a3061504132eeff844e9cc827142d36" -> (known after apply)
      ~ last_modified                  = "2025-07-31T07:02:22.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8927679592065745102" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065386115000" -> "1754293750875693000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2160224358864466674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753945065293873000" -> "1754293750732071000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:17" -> (known after apply)
      ~ code_sha256                 = "l6UU8IaxT6SYkPWOMOm7qFv+Og4XqkokYbdNpKcyBe0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-31T07:00:37.767+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:17" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172655 -> (known after apply)
      ~ version                     = "17" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "8a5a2dac59df3477f1fafcf0c2ff2999" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> (known after apply)
      ~ key                           = "builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1900795131443381035" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/5c17e26be633e9224a9b7b17130b533c4838310eed5d8a3191ecb1af0059471f.zip" -> "builds/325b4d65f9dcfbd78f8d4875504dd4454faf5b94115dbd1d8b6e99824faeda29.zip"
          ~ "timestamp" = "1753945066886754000" -> "1754293761549640000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50" -> (known after apply)
      ~ code_sha256                 = "TAaeogodcoz9lqz49AC7SMs1paSAPd5JmCN9aXN7zlc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-31T07:00:37.772+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:50" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22516 -> (known after apply)
      ~ version                     = "50" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "430ee104d7c14b053f8816452fb6ba47" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> (known after apply)
      ~ key                           = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7171513106489901447" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a31ca7052bddc64ae50899ca15da9ca72844c8beba051a1d53169c276de66c44.zip" -> "builds/280f6fc5a3e9c8bc62888fa7663c8cd225636c1de582a2bb57860c8ac8547dd1.zip"
          ~ "timestamp" = "1753945064908279800" -> "1754293751036985000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:0ceea7c5e26f5f5dffc40d9d15057a23d2d9518801b6019f2212e9b3a6fb22a7557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:0ceea7c5e26f5f5dffc40d9d15057a23d2d9518801b6019f2212e9b3a6fb22a7" -> (known after apply)
        name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.